pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_data.c
// bl602_demo_at_data.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 4200C498: void AON_Power_On_BG()
void AON_Power_On_BG()
{
	(*(<anonymous> **) 0x21010828)();
}

// 4200C4A2: void AON_Power_Off_BG()
void AON_Power_Off_BG()
{
	(*(<anonymous> **) 553715756)();
}

// 4200C4AC: void AON_Power_On_LDO11_SOC()
void AON_Power_On_LDO11_SOC()
{
	(*(<anonymous> **) 0x21010830)();
}

// 4200C4B6: void AON_Power_Off_LDO11_SOC()
void AON_Power_Off_LDO11_SOC()
{
	(*(<anonymous> **) 553715764)();
}

// 4200C4C0: void AON_Power_On_LDO15_RF()
void AON_Power_On_LDO15_RF()
{
	(*(<anonymous> **) 0x21010838)();
}

// 4200C4CA: void AON_Power_Off_LDO15_RF()
void AON_Power_Off_LDO15_RF()
{
	(*(<anonymous> **) 553715772)();
}

// 4200C4D4: void AON_Power_On_SFReg()
void AON_Power_On_SFReg()
{
	(*(<anonymous> **) 0x21010840)();
}

// 4200C4DE: void AON_Power_Off_SFReg()
void AON_Power_Off_SFReg()
{
	(*(<anonymous> **) 0x21010844)();
}

// 4200C4E8: void AON_LowPower_Enter_PDS0()
void AON_LowPower_Enter_PDS0()
{
	(*(<anonymous> **) 0x21010848)();
}

// 4200C4F2: void AON_LowPower_Exit_PDS0()
void AON_LowPower_Exit_PDS0()
{
	(*(<anonymous> **) 553715788)();
}

// 4200C4FC: void ASM_Delay_Us()
void ASM_Delay_Us()
{
	(*(<anonymous> **) 0x21010850)();
}

// 4200C506: void BL602_Delay_US()
void BL602_Delay_US()
{
	(*(<anonymous> **) 553715796)();
}

// 4200C510: void BL602_Delay_MS()
void BL602_Delay_MS()
{
	(*(<anonymous> **) 0x21010858)();
}

// 4200C51A: void BL602_MemCpy()
void BL602_MemCpy()
{
	(*(<anonymous> **) 0x2101085C)();
}

// 4200C524: void BL602_MemCpy4()
void BL602_MemCpy4()
{
	(*(<anonymous> **) 0x21010860)();
}

// 4200C52E: void BL602_MemCpy_Fast()
void BL602_MemCpy_Fast()
{
	(*(<anonymous> **) 553715812)();
}

// 4200C538: void BL602_MemSet()
void BL602_MemSet()
{
	(*(<anonymous> **) 0x21010868)();
}

// 4200C542: void BL602_MemSet4()
void BL602_MemSet4()
{
	(*(<anonymous> **) 0x2101086C)();
}

// 4200C54C: void BL602_MemCmp()
void BL602_MemCmp()
{
	(*(<anonymous> **) 0x21010870)();
}

// 4200C556: void EF_Ctrl_Sw_AHB_Clk_0()
// Called from:
//      EF_Ctrl_Read_TSEN_Trim
//      EF_Ctrl_Read_ADC_Gain_Trim
void EF_Ctrl_Sw_AHB_Clk_0()
{
	(*(<anonymous> **) 553715828)();
}

// 4200C560: void EF_Ctrl_Program_Efuse_0()
void EF_Ctrl_Program_Efuse_0()
{
	(*(<anonymous> **) 0x21010878)();
}

// 4200C56A: void EF_Ctrl_Load_Efuse_R0()
// Called from:
//      EF_Ctrl_Read_TSEN_Trim
//      EF_Ctrl_Read_ADC_Gain_Trim
void EF_Ctrl_Load_Efuse_R0()
{
	(*(<anonymous> **) 553715836)();
}

// 4200C574: void EF_Ctrl_Busy()
void EF_Ctrl_Busy()
{
	(*(<anonymous> **) 0x21010880)();
}

// 4200C57E: void EF_Ctrl_AutoLoad_Done()
void EF_Ctrl_AutoLoad_Done()
{
	(*(<anonymous> **) 0x21010884)();
}

// 4200C588: void EF_Ctrl_Clear()
void EF_Ctrl_Clear()
{
	(*(<anonymous> **) 0x21010894)();
}

// 4200C592: void GLB_SW_System_Reset()
void GLB_SW_System_Reset()
{
	(*(<anonymous> **) 553715900)();
}

// 4200C59C: void GLB_SW_CPU_Reset()
void GLB_SW_CPU_Reset()
{
	(*(<anonymous> **) 0x210108C0)();
}

// 4200C5A6: void GLB_SW_POR_Reset()
void GLB_SW_POR_Reset()
{
	(*(<anonymous> **) 0x210108C4)();
}

// 4200C5B0: void GLB_Select_Internal_Flash()
void GLB_Select_Internal_Flash()
{
	(*(<anonymous> **) 0x210108C8)();
}

// 4200C5BA: void GLB_Select_External_Flash()
void GLB_Select_External_Flash()
{
	(*(<anonymous> **) 0x210108CC)();
}

// 4200C5C4: void GLB_Deswap_Flash_Pin()
void GLB_Deswap_Flash_Pin()
{
	(*(<anonymous> **) 0x210108D0)();
}

// 4200C5CE: void GLB_Swap_Flash_Pin()
void GLB_Swap_Flash_Pin()
{
	(*(<anonymous> **) 0x210108D4)();
}

// 4200C5D8: void GLB_GPIO_Init()
void GLB_GPIO_Init()
{
	(*(<anonymous> **) 0x210108D8)();
}

// 4200C5E2: void GLB_GPIO_OUTPUT_Enable()
void GLB_GPIO_OUTPUT_Enable()
{
	(*(<anonymous> **) 553715932)();
}

// 4200C5EC: void GLB_GPIO_OUTPUT_Disable()
void GLB_GPIO_OUTPUT_Disable()
{
	(*(<anonymous> **) 0x210108E0)();
}

// 4200C5F6: void GLB_GPIO_Set_HZ()
void GLB_GPIO_Set_HZ()
{
	(*(<anonymous> **) 0x210108E4)();
}

// 4200C600: void GLB_GPIO_Get_Fun()
void GLB_GPIO_Get_Fun()
{
	(*(<anonymous> **) 0x210108E8)();
}

// 4200C60A: void HBN_Mode_Enter()
void HBN_Mode_Enter()
{
	(*(<anonymous> **) 0x210108EC)();
}

// 4200C614: void HBN_Power_Down_Flash()
void HBN_Power_Down_Flash()
{
	(*(<anonymous> **) 0x210108F0)();
}

// 4200C61E: void HBN_Enable()
void HBN_Enable()
{
	(*(<anonymous> **) 553715956)();
}

// 4200C628: void HBN_Reset()
void HBN_Reset()
{
	(*(<anonymous> **) 0x210108F8)();
}

// 4200C632: void HBN_Set_Ldo11_Aon_Vout()
void HBN_Set_Ldo11_Aon_Vout()
{
	(*(<anonymous> **) 0x210108FC)();
}

// 4200C63C: void HBN_Set_Ldo11_Rt_Vout()
void HBN_Set_Ldo11_Rt_Vout()
{
	(*(<anonymous> **) 0x21010900)();
}

// 4200C646: void HBN_Set_Ldo11_Soc_Vout()
void HBN_Set_Ldo11_Soc_Vout()
{
	(*(<anonymous> **) 0x21010904)();
}

// 4200C650: void HBN_Hw_Pu_Pd_Cfg()
void HBN_Hw_Pu_Pd_Cfg()
{
	(*(<anonymous> **) 0x21010924)();
}

// 4200C65A: void HBN_Pin_WakeUp_Mask()
void HBN_Pin_WakeUp_Mask()
{
	(*(<anonymous> **) 0x21010928)();
}

// 4200C664: void HBN_GPIO7_Dbg_Pull_Cfg()
void HBN_GPIO7_Dbg_Pull_Cfg()
{
	(*(<anonymous> **) 0x2101092C)();
}

// 4200C66E: void HBN_Set_Embedded_Flash_Pullup()
void HBN_Set_Embedded_Flash_Pullup()
{
	(*(<anonymous> **) 0x21010930)();
}

// 4200C678: void L1C_Set_Wrap()
void L1C_Set_Wrap()
{
	(*(<anonymous> **) 0x21010934)();
}

// 4200C682: void L1C_Set_Way_Disable()
void L1C_Set_Way_Disable()
{
	(*(<anonymous> **) 0x21010938)();
}

// 4200C68C: void L1C_IROM_2T_Access_Set()
void L1C_IROM_2T_Access_Set()
{
	(*(<anonymous> **) 0x2101093C)();
}

// 4200C696: void PDS_Reset()
void PDS_Reset()
{
	(*(<anonymous> **) 0x21010940)();
}

// 4200C6A0: void PDS_Force_Config()
void PDS_Force_Config()
{
	(*(<anonymous> **) 0x21010948)();
}

