pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_data.c
// 4200CB5C: void ADC_Gain_Trim(Register (ptr32 Eq_582221) a4, Stack word32 dwArg14, Stack word32 dwArgB4, Stack word32 dwArg0128)
void ADC_Gain_Trim(struct Eq_582221 * a4, word32 dwArg14, word32 dwArgB4, word32 dwArg0128)
{
	word32 a4_21;
	uint32 a0_18 = EF_Ctrl_Read_ADC_Gain_Trim(a4, out a4_21);
	if (a0_18 << 0x12 < 0x00)
	{
		EF_Ctrl_Get_Trim_Parity();
		if ((a0_18 >> 0x0C & 0x01) == (word32) ((word16) (a0_18 & 0x00FFFFFF)))
		{
			word32 a4_112;
			word32 s4_103;
			word32 s3_102;
			word32 s2_101;
			word32 s1_100;
			word32 s0_163;
			g_b4200ECD4 = 0x01;
			g_w4200ECD6 = 0x01;
			if (false)
			{
				word32 s0_121;
				word32 s1_122;
				word32 s2_123;
				word32 s3_124;
				word32 s4_125;
				word32 a4_134;
				g_t230A31AC();
				word32 s0_142;
				word32 s1_143;
				word32 s2_144;
				word32 s3_145;
				word32 s4_146;
				word32 a4_155;
				g_t230A1B50();
				word32 a1_173;
				word32 fa0_174;
				g_t230A04B4();
			}
			else
			{
				word32 s0_55;
				word32 s1_56;
				word32 s2_57;
				word32 s3_58;
				word32 s4_59;
				word32 a4_68;
				g_t230A31AC();
				word32 a0_74;
				word32 s0_76;
				word32 s1_77;
				word32 s2_78;
				word32 s3_79;
				word32 s4_80;
				word32 a1_86;
				word32 a4_89;
				g_t230A1B50();
				word32 a1_109;
				word32 fa0_110;
				g_t230A22EC();
			}
			struct Eq_582298 * a0_187;
			real32 s0_189;
			word32 a1_199;
			word32 fa0_200;
			g_t230A32BC();
			a0_187->r0004 = s0_189;
l4200CB7A:
			0x00 = dwArg0128;
			return;
		}
	}
	goto l4200CB7A;
}

// 4200CCE4: Register word32 EF_Ctrl_Read_TSEN_Trim(Register ui32 a4)
// Called from:
//      ADC_Trim_TSEN
word32 EF_Ctrl_Read_TSEN_Trim(ui32 a4)
{
	EF_Ctrl_Sw_AHB_Clk_0();
	EF_Ctrl_Load_Efuse_R0();
	word32 a0_18 = *(a4 & 0x01);
	word32 * a4_22 = a4 & 0x01 & ~0x02000000 | (a4 & 0x01) << 0x0D;
	*a4_22 = a0_18;
	word32 * a5_33 = (a4_22 & 0xFF000000 | 0x0FFF) & ~0x01000000 | 0x01000000;
	*a5_33 = a0_18;
	*(a5_33 & ~0x04000000) = a0_18;
	return a0_18;
}

// 4200CD40: Register word32 EF_Ctrl_Read_ADC_Gain_Trim(Register (ptr32 Eq_582221) a4, Register out Eq_582230 a4Out)
// Called from:
//      ADC_Gain_Trim
word32 EF_Ctrl_Read_ADC_Gain_Trim(struct Eq_582221 * a4, union Eq_582230 & a4Out)
{
	EF_Ctrl_Sw_AHB_Clk_0();
	EF_Ctrl_Load_Efuse_R0();
	word32 * a5_14 = a4->ptr0078;
	ui32 a4_29 = a4 >> 0x0E & 0x01;
	word32 a0_15 = *a5_14;
	*(((a5_14 & 0xFF000000 | (a4 << 0x13) >> 20) & ~0x01000000 | (a4 >> 0x0D & 0x01) << 0x0C) & ~0x02000000 | a4_29 << 0x0D) = a0_15;
	a4Out = a4_29 << 0x0D;
	return a0_15;
}

// 4200CD86: void AON_Power_On_MBG()
void AON_Power_On_MBG()
{
	(*(<anonymous> **) 0x21010810)();
}

// 4200CD90: void AON_Power_Off_MBG()
void AON_Power_Off_MBG()
{
	(*(<anonymous> **) 0x21010814)();
}

// 4200CD9A: void AON_Power_On_XTAL()
void AON_Power_On_XTAL()
{
	(*(<anonymous> **) 0x21010818)();
}

// 4200CDA4: void AON_Set_Xtal_CapCode()
void AON_Set_Xtal_CapCode()
{
	(*(<anonymous> **) 0x2101081C)();
}

// 4200CDAE: void AON_Get_Xtal_CapCode()
void AON_Get_Xtal_CapCode()
{
	(*(<anonymous> **) 0x21010820)();
}

// 4200CDB8: void AON_Power_Off_XTAL()
void AON_Power_Off_XTAL()
{
	(*(<anonymous> **) 0x21010824)();
}

// 4200CDC2: Register word32 EF_Ctrl_Get_Trim_Parity()
// Called from:
//      ADC_Trim_TSEN
//      ADC_Gain_Trim
word32 EF_Ctrl_Get_Trim_Parity()
{
	word32 a5_7;
	(*(<anonymous> **) 0x21010888)();
	return a5_7;
}

// 4200CDCC: void EF_Ctrl_Read_RC32M_Trim()
void EF_Ctrl_Read_RC32M_Trim()
{
	(*(<anonymous> **) 0x2101088C)();
}

// 4200CDD6: void EF_Ctrl_Read_RC32K_Trim()
void EF_Ctrl_Read_RC32K_Trim()
{
	(*(<anonymous> **) 0x21010890)();
}

// 4200CDE0: void GLB_Get_Root_CLK_Sel()
void GLB_Get_Root_CLK_Sel()
{
	(*(<anonymous> **) 0x21010898)();
}

// 4200CDEA: void GLB_Set_System_CLK_Div()
void GLB_Set_System_CLK_Div()
{
	(*(<anonymous> **) 553715868)();
}

// 4200CDF4: void GLB_Get_BCLK_Div()
void GLB_Get_BCLK_Div()
{
	(*(<anonymous> **) 0x210108A0)();
}

// 4200CDFE: void GLB_Get_HCLK_Div()
void GLB_Get_HCLK_Div()
{
	(*(<anonymous> **) 553715876)();
}

// 4200CE08: void Update_SystemCoreClockWith_XTAL()
void Update_SystemCoreClockWith_XTAL()
{
	(*(<anonymous> **) 0x210108A8)();
}

// 4200CE12: void GLB_Set_System_CLK()
void GLB_Set_System_CLK()
{
	(*(<anonymous> **) 553715884)();
}

// 4200CE1C: void System_Core_Clock_Update_From_RC32M()
void System_Core_Clock_Update_From_RC32M()
{
	(*(<anonymous> **) 0x210108B0)();
}

// 4200CE26: void GLB_Set_SF_CLK()
void GLB_Set_SF_CLK()
{
	(*(<anonymous> **) 0x210108B4)();
}

// 4200CE30: void GLB_Set_PKA_CLK_Sel()
void GLB_Set_PKA_CLK_Sel()
{
	(*(<anonymous> **) 0x210108B8)();
}

// 4200CE3A: void HBN_32K_Sel()
void HBN_32K_Sel()
{
	(*(<anonymous> **) 0x21010908)();
}

// 4200CE44: void HBN_Set_ROOT_CLK_Sel()
void HBN_Set_ROOT_CLK_Sel()
{
	(*(<anonymous> **) 0x2101090C)();
}

// 4200CE4E: void HBN_Power_On_Xtal_32K()
void HBN_Power_On_Xtal_32K()
{
	(*(<anonymous> **) 0x21010910)();
}

// 4200CE58: void HBN_Power_Off_Xtal_32K()
void HBN_Power_Off_Xtal_32K()
{
	(*(<anonymous> **) 0x21010914)();
}

// 4200CE62: void HBN_Power_On_RC32K()
void HBN_Power_On_RC32K()
{
	(*(<anonymous> **) 0x21010918)();
}

// 4200CE6C: void HBN_Power_Off_RC32K()
void HBN_Power_Off_RC32K()
{
	(*(<anonymous> **) 0x2101091C)();
}

// 4200CE76: void HBN_Trim_RC32K()
void HBN_Trim_RC32K()
{
	(*(<anonymous> **) 0x21010920)();
}

// 4200CE80: void PDS_Trim_RC32M()
void PDS_Trim_RC32M()
{
	(*(<anonymous> **) 0x21010954)();
}

// 4200CE8A: void PDS_Select_RC32M_As_PLL_Ref()
void PDS_Select_RC32M_As_PLL_Ref()
{
	(*(<anonymous> **) 553716056)();
}

// 4200CE94: void PDS_Select_XTAL_As_PLL_Ref()
void PDS_Select_XTAL_As_PLL_Ref()
{
	(*(<anonymous> **) 0x2101095C)();
}

// 4200CE9E: void PDS_Power_On_PLL()
void PDS_Power_On_PLL()
{
	(*(<anonymous> **) 0x21010960)();
}

