pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_data.c
// 4200CEA8: void PDS_Enable_PLL_All_Clks()
void PDS_Enable_PLL_All_Clks()
{
	(*(<anonymous> **) 0x21010964)();
}

// 4200CEB2: void PDS_Disable_PLL_All_Clks()
void PDS_Disable_PLL_All_Clks()
{
	(*(<anonymous> **) 0x21010968)();
}

// 4200CEBC: void PDS_Enable_PLL_Clk()
void PDS_Enable_PLL_Clk()
{
	(*(<anonymous> **) 0x2101096C)();
}

// 4200CEC6: void PDS_Disable_PLL_Clk()
void PDS_Disable_PLL_Clk()
{
	(*(<anonymous> **) 0x21010970)();
}

// 4200CED0: void PDS_Power_Off_PLL()
void PDS_Power_Off_PLL()
{
	(*(<anonymous> **) 0x21010974)();
}

Eq_3793 g_t4200CEDC = 
	{
		0x420280F3,
		0x0001770D,
	};
word32 g_dw4200CF0C = 0x23001006;
byte g_a4200CF20[5] = 
	{
		0x12,
		0x12,
		0x12,
		0x12,
		0x12,
	};
byte g_a4200CF28[] = 
	{
	};
byte g_a4200CF30[] = 
	{
	};
uint16 g_a4200CF38[22] = 
	{
		~0x5914,
		42802,
		~0x5886,
		42944,
		0xA808,
		0xA84F,
		0xA896,
		~0x5722,
		43300,
		43371,
		43442,
		~0x5606,
		0xAA40,
		0xAA87,
		~0x5530,
		0xAB16,
		~0x54A2,
		0xABA4,
		44011,
		44082,
		44153,
		0x00,
	};
word16 g_w4200CF60 = 44153;
int32 g_dw4200CF64 = 0x14088889;
int32 g_dw4200CF88 = 0x14555555;
word32 g_dw4200CFB8 = 0x00;
word32 g_dw4200CFBC = 0x00;
word32 g_dw4200CFC0 = 0x00;
word32 g_dw4200CFC4 = 0x00;
word32 g_dw4200CFC8 = 0x00;
word32 g_dw4200CFCC = 0x00;
word32 g_dw4200CFD0 = 0x00;
word32 g_dw4200CFD4 = 0x00;
word32 g_dw4200CFD8 = 0x01;
word32 g_dw4200CFDC = 8000000;
word32 g_dw4200CFE0 = 0x01;
word32 g_dw4200CFE4 = 3000000;
word32 g_dw4200CFE8 = 0x01;
word32 g_dw4200CFEC = 4292967296;
word32 g_dw4200CFF0 = 0x01;
word32 g_dw4200CFF4 = 0xFF953040;
word32 g_dw4200CFF8 = 0x00;
word32 g_dw4200CFFC = 0x00;
word32 g_dw4200D000 = 0x00;
word32 g_dw4200D004 = 0x00;
word32 g_dw4200D008 = 0x00;
word32 g_dw4200D00C = 0x00;
word32 g_dw4200D010 = 0x00;
word32 g_dw4200D014 = 0x00;
word32 g_dw4200D018 = 0x01;
word32 g_dw4200D01C = 8000000;
word32 g_dw4200D020 = 0x01;
word32 g_dw4200D024 = ~0x003D08FF;
Eq_14451 g_t4200D028 = 
	{
		~0x04,
		0x0F,
	};
word32 g_dw4200D038 = 0x0F;
int32 g_dw4200D03C = 0x0033;
byte g_a4200D05C[17] = 
	{
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		~0x04,
		~0x08,
		252,
		~0x07,
		~0x04,
		~0x08,
		0x01,
	};
Eq_2 g_t4200D0B0 = 
	{
		1
	};
Eq_109036 g_t4200D45C = 
	{
		0x00,
		0x00,
		
		{
			0
		},
		0x00,
	};
byte g_b4200D49E = 0x00;
byte g_b4200D49F = 0x00;
byte g_b4200D4A8 = 0x00;
Eq_2 g_t4200D6BC = 
	{
		0
	};
Eq_2 g_t4200D6C0 = 
	{
		0
	};
Eq_582962 g_a4200D6CA[] = 
	{
	};
Eq_582963 g_a4200D6CC[] = 
	{
	};
struct Eq_225342 * g_ptr4200D6D4 = null;
Eq_249106 g_a4200D6DC[] = 
	{
	};
byte g_b4200D6DF = 0x00;
struct Eq_221833 g_t4200D6E4 = 
	{
		0x00,
		0x00,
	};
word32 g_dw4200D718 = 0x00;
word32 g_dw4200D71C = 0x00;
word32 g_dw4200D728 = 0x00;
word32 g_dw4200D72C = 0x00;
uint16 g_w4200D738 = 0x00;
int32 g_dw4200D760 = 0;
byte g_b4200D763 = 0x00;
uint16 g_w4200D76E = 0x00;
struct Eq_249688 * g_ptr4200D79C = null;
word32 g_dw4200D7A0 = 0x00;
byte g_b4200D7A4 = 0x00;
word32 g_dw4200D7AC = 0x00;
word32 g_dw4200D7B0 = 0x00;
uint16 g_w4200D7BC = 0x00;
byte g_b4200D7E4 = 0x00;
byte g_b4200D7E6 = 0x00;
byte g_b4200D7E7 = 0x00;
uint16 g_w4200D7E8 = 0x00;
byte g_b4200D7EA = 0x00;
byte g_b4200D7EB = 0x00;
Eq_189182 g_t4200D7EC = 
	{
		0
	};
Eq_187152 g_t4200D7F0 = 
	{
		0
	};
byte g_b4200D7F1 = 0x00;
uint16 g_w4200D7F2 = 0x00;
word16 g_w4200D7F4 = 0x00;
uint16 g_w4200D7F6 = 0x00;
uint16 g_a4200D81C[] = 
	{
	};
byte g_b4200D838 = 0x00;
uint16 g_w4200D870 = ~0x00;
uint16 g_w4200D872 = 0x00;
byte g_b4200D874 = 0x00;
uint16 g_w4200D898 = ~0x00;
uint16 g_w4200D89A = 0x00;
byte g_b4200D89C = 0x00;
struct Eq_235552 g_t4200D8C0 = 
	{
		
		{
			0
		},
	};
Eq_197149 g_t4200D8C4 = 
	{
		0x00
	};
byte g_b4200D8C5 = 0x00;
uint16 g_w4200D8DC = ~0x00;
byte g_b4200D8DE = 0x00;
byte g_b4200D8E0 = 0x00;
Eq_220221 g_t4200D8F0 = 
	{
		0x00,
	};
byte g_b4200D9A8 = 0x00;
byte g_b4200D9A9 = 0x00;
uint16 g_w4200D9C0 = ~0x00;
byte g_b4200D9C4 = 0x00;
Eq_582953 g_a4200DA88[6] = 
	{
		
		{
			
			{
				0x00
			},
			0x00,
		},
		
		{
			
			{
				0x00
			},
			0x00,
		},
		
		{
			
			{
				0x00
			},
			0x00,
		},
		
		{
			
			{
				0x00
			},
			0x00,
		},
		
		{
			
			{
				0x00
			},
			0x00,
		},
		
		{
			
			{
				0x00
			},
			0x00,
		},
	};
Eq_2 g_t4200DAB0 = 
	{
		0
	};
byte g_b4200DAB6 = 0x00;
word16 g_w4200DAEE = 0x00;
word16 g_w4200DB32 = 0x00;
word32 g_dw4200DB34 = 0x00;
word32 g_dw4200DB38 = 0x23044CAA;
word16 g_w4200DBEA = 0x00;
byte g_b4200DC72 = 0x00;
struct Eq_242447 * g_ptr4200DC9C = null;
Eq_2 g_t4200DD1C = 
	{
		0
	};
Eq_2 g_t4200DD24 = 
	{
		0
	};
Eq_259348 g_t4200DD28 = 
	{
		null,
	};
word32 g_dw4200DD30 = 0x00;
Eq_263508 g_t4200DD38 = 
	{
		0x00,
		0x00,
		0x00,
		0x00,
		0x00,
		null,
		sc_ccc_cfg_write,
	};
byte g_b4200DD60 = 0x00;
byte g_b4200DD67 = 0x00;
byte g_b4200DD68 = 0x00;
Eq_2 g_a4200DD6B[] = 
	{
	};
byte g_b4200DD70 = 0x00;
byte g_b4200DDA2 = 0x00;
byte g_b4200DDD0 = 0x00;
uint16 g_w4200DDE0 = 0x00;
Eq_2 g_t4200DDE4 = 
	{
		0
	};
byte g_b4200DDF0 = 0x00;
byte g_b4200DDF1 = 0x00;
byte g_b4200DDF3 = 0x00;
int32 g_dw4200DDF8 = 0;
struct Eq_255648 * g_ptr4200DE04 = null;
struct Eq_278945 * g_ptr4200DE14 = null;
word32 g_dw4200DE8C = 0x23051288;
word32 g_dw4200DEA8 = 587542172;
word16 g_w4200DEC0 = 0x0101;
byte g_b4200DEC8 = 0x09;
byte g_b4200DEC9 = 0x0D;
Eq_2 g_t4200DECC = 
	{
		-76
	};
word32 g_dw4200DEF0 = 587557408;
word32 g_dw4200E00C = 0x23056D66;
word32 g_dw4200E0EC = 587577716;
Eq_2 g_t4200E134 = 
	{
		43
	};
Eq_2 g_t4200E138 = 
	{
		44
	};
Eq_2 g_t4200E13C = 
	{
		0
	};
Eq_2 g_t4200E140 = 
	{
		6
	};
word32 g_dw4200E17C = 0x00;
Eq_2 g_t4200E198 = 
	{
		0
	};
<anonymous> * g_ptr4200E658 = __ascii_wctomb;
<anonymous> * g_ptr4200E65C = __ascii_mbtowc;
struct Eq_577958 g_t4200E6E4 = 
	{
		
		{
		},
		0,
		&g_t4200E6E4,
		&g_t4200E6E4,
	};
Eq_450439 g_t4200E6E8 = 
	{
		null
	};
struct Eq_577958 * g_ptr4200E6EC = &g_t4200E6E4;
struct Eq_577958 * g_ptr4200E6F4 = &g_t4200E6EC;
struct Eq_577958 * g_ptr4200E6F8 = &g_t4200E6EC;
Eq_2 g_t4200EAF4 = 
	{
		-1
	};
int32 g_dw4200EAF8 = 0x02CC;
int8 g_b4200EAFC = -0x0080;
uint16 g_w4200EB08 = 0xA6A0;
uint16 g_w4200EB0A = 0xA6E0;
uint16 g_w4200EB0C = 0xACE0;
uint16 g_w4200EB0E = 0x0855;
uint16 g_w4200EB14 = 0x05;
uint16 g_w4200EB16 = 0x05;
uint16 g_w4200EB18 = 0x05;
struct Eq_12928 * g_ptr4200EB1C = &g_t42012010;
byte g_b4200EB20 = ~0x00;
struct Eq_12928 * g_ptr4200EB2C = &g_t0001;
Eq_2 g_t4200EB34 = 
	{
		-96
	};
int32 g_dw4200EB38 = 92;
int32 g_dw4200EB3C = 671125322;
int8 g_b4200EB40 = 0x007F;
byte g_b4200EB4C = ~0x00;
word32 g_dw4200EB50 = 0x2304400A;
byte g_b4200EC3D = 0x01;
word32 g_dw4200EC40 = 0x23054904;
<anonymous> * g_ptr4200ECA4 = free;
<anonymous> * g_ptr4200ECA8 = malloc;
int8 g_b4200ECAC = -1;
int8 g_b4200ECAD = -1;
byte g_b4200ECB8 = 0x01;
uint16 g_w4200ECBA = ~0x00;
uint16 g_w4200ECC0 = 0xC000;
uint16 g_w4200ECC2 = 0xC000;
Eq_448697 g_t4200ECC4 = 
	{
		<code>,
		&g_t4200ECC4,
		0x00,
	};
Eq_2 g_t4200ECD0 = 
	{
		-1
	};
byte g_b4200ECD4 = 0x00;
word16 g_w4200ECD6 = 0x00;
byte g_b4200ECDC = 0x03;
Eq_2 g_t4200ECE4 = 
	{
		8
	};
Eq_2 g_t4200ECFC = 
	{
		80
	};
int32 g_dw4200ED00 = -1;
Eq_578070 g_t4200ED04 = 
	{
		0x00020000
	};
Eq_2 g_t4200ED20 = 
	{
		0
	};
Eq_2 g_t4200ED24 = 
	{
		0
	};
Eq_2 g_t4200ED28 = 
	{
		-100
	};
Eq_2 g_t4200ED2C = 
	{
		60
	};
Eq_2 g_t4200ED30 = 
	{
		0
	};
Eq_2 g_t4200ED34 = 
	{
		0
	};
Eq_2 g_t4200ED38 = 
	{
		0
	};
Eq_2 g_t4200ED3C = 
	{
		0
	};
Eq_2 g_t4200ED40 = 
	{
		0
	};
Eq_2 g_t4200ED44 = 
	{
		3
	};
Eq_2 g_t4200ED48 = 
	{
		6
	};
Eq_2 g_t4200ED4C = 
	{
		-21
	};
Eq_2 g_t4200ED50 = 
	{
		0
	};
Eq_2 g_t4200ED54 = 
	{
		0
	};
Eq_2 g_t4200ED58 = 
	{
		0
	};
Eq_2 g_t4200ED5C = 
	{
		0
	};
Eq_2 g_t4200ED60 = 
	{
		0
	};
Eq_2 g_t4200ED64 = 
	{
		71
	};
Eq_2 g_t4200ED68 = 
	{
		0x0044
	};
Eq_2 g_t4200ED6C = 
	{
		11
	};
Eq_2 g_t4200ED70 = 
	{
		0
	};
Eq_2 g_t4200ED74 = 
	{
		0
	};
Eq_2 g_t4200ED78 = 
	{
		0x0055
	};
Eq_2 g_t4200ED7C = 
	{
		0x0055
	};
Eq_2 g_t4200ED80 = 
	{
		0
	};
Eq_2 g_t4200ED84 = 
	{
		0
	};
Eq_2 g_t4200ED88 = 
	{
		-2
	};
Eq_2 g_t4200ED8C = 
	{
		71
	};
Eq_2 g_t4200ED90 = 
	{
		0
	};
Eq_2 g_t4200ED94 = 
	{
		0
	};
Eq_2 g_t4200ED98 = 
	{
		-0x0011
	};
Eq_2 g_t4200ED9C = 
	{
		40
	};
Eq_2 g_t4200EDA0 = 
	{
		101
	};
Eq_2 g_t4200EDA4 = 
	{
		74
	};
Eq_2 g_t4200EDA8 = 
	{
		1
	};
Eq_2 g_t4200EDAC = 
	{
		96
	};
Eq_2 g_t4200EDB0 = 
	{
		77
	};
Eq_2 g_t4200EDB4 = 
	{
		0x0055
	};
Eq_2 g_t4200EDB8 = 
	{
		-1
	};
Eq_2 g_t4200EDBC = 
	{
		-74
	};
Eq_2 g_t4200EDC0 = 
	{
		3
	};
Eq_2 g_t4200EDC4 = 
	{
		0x0033
	};
Eq_2 g_t4200EDD0 = 
	{
		0
	};
Eq_2 g_t4200EDD4 = 
	{
		9
	};
Eq_2 g_t4200EDD8 = 
	{
		-3
	};
Eq_2 g_t4200EDDC = 
	{
		9
	};
Eq_2 g_t4200EDE0 = 
	{
		-11
	};
Eq_2 g_t4200EDE4 = 
	{
		-32
	};
Eq_2 g_t4200EDE8 = 
	{
		-2
	};
Eq_2 g_t4200EDEC = 
	{
		71
	};
Eq_2 g_t4200EDF0 = 
	{
		89
	};
Eq_2 g_t4200EDF4 = 
	{
		31
	};
Eq_2 g_t4200EDF8 = 
	{
		0
	};
Eq_2 g_t4200EDFC = 
	{
		67
	};
Eq_2 g_t4200EE00 = 
	{
		-0x0011
	};
Eq_2 g_t4200EE04 = 
	{
		66
	};
Eq_2 g_t4200EE08 = 
	{
		57
	};
Eq_2 g_t4200EE0C = 
	{
		97
	};
Eq_2 g_t4200EE10 = 
	{
		-48
	};
Eq_2 g_t4200EE14 = 
	{
		0x0069
	};
Eq_2 g_t4200EE18 = 
	{
		-0x0F
	};
Eq_2 g_t4200EE1C = 
	{
		65
	};
Eq_2 g_t4200EE20 = 
	{
		44
	};
Eq_2 g_t4200EE24 = 
	{
		0x006A
	};
Eq_2 g_t4200EE28 = 
	{
		-0x006D
	};
Eq_2 g_t4200EE2C = 
	{
		0x006C
	};
Eq_2 g_t4200EE30 = 
	{
		62
	};
Eq_2 g_t4200EE34 = 
	{
		0x0055
	};
Eq_2 g_t4200EE38 = 
	{
		0
	};
Eq_2 g_t4200EE3C = 
	{
		0
	};
int32 g_dw4200EE40 = 0;
Eq_563594 g_t4200EE44 = 
	{
		0x7FF80000
	};
Eq_2 g_t4200EE48 = 
	{
		0
	};
Eq_2 g_t4200EE4C = 
	{
		0
	};
Eq_2 g_t4200EE50 = 
	{
		-100
	};
Eq_2 g_t4200EE54 = 
	{
		60
	};
Eq_2 g_t4200EE58 = 
	{
		89
	};
Eq_2 g_t4200EE5C = 
	{
		31
	};
Eq_2 g_t4200EE60 = 
	{
		0
	};
Eq_2 g_t4200EE64 = 
	{
		0
	};
Eq_2 g_t4200EE68 = 
	{
		0
	};
Eq_2 g_t4200EE6C = 
	{
		0
	};
Eq_2 g_t4200EEA0 = 
	{
		80
	};
struct Eq_195346 g_t4200EECC = 
	{
		
		{
			0
		},
		
		{
			0x00
		},
		0,
		
		{
			0
		},
		
		{
			0x00020002
		},
		0,
		0x00,
		0x00,
		0x00,
	};
<anonymous> ******* g_a4200EEFC[] = 
	{
	};
uint16 g_w4200EF4A = 0x0A;
Eq_582985 g_a4200EF74[2] = 
	{
		
		{
			587967728,
			
			{
				4
			},
		},
		
		{
			587967808,
			
			{
				7
			},
		},
	};
Eq_263477 g_t4200EF84 = 
	{
		4,
		587562648,
	};
